eagletrt/chimera-bms/BMS_STM32F334k8/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  /* USER CODE BEGIN 2 */

  /* SETTING CAN */
  sFilter.FilterMode = CAN_FILTERMODE_IDMASK;
  sFilter.FilterMode = CAN_FILTERMODE_IDMASK;
  sFilter.FilterIdLow = 0;
  sFilter.FilterIdHigh = 0;
  sFilter.FilterMaskIdHigh = 0;
  sFilter.FilterMaskIdLow = 0;
  sFilter.FilterFIFOAssignment = CAN_FILTER_FIFO0;
  sFilter.BankNumber = 0;
  sFilter.FilterScale = CAN_FILTERSCALE_16BIT;
  sFilter.FilterActivation = ENABLE;
  HAL_CAN_ConfigFilter(&hcan, &sFilter);

  HAL_CAN_Init(&hcan);

  int TOT_IC=12; // number of daisy chain
  int CELL_CH=9;

  uint8_t NUM_RX_BYT = 8;
  uint8_t BYT_IN_REG = 6;
  uint8_t CELL_IN_REG = 3;
  uint8_t NUM_CV_REG = 3;
  uint8_t *cell_data;
  uint16_t cell_codes[TOT_IC][CELL_CH];
  uint16_t cell_codes_temp[TOT_IC][CELL_CH];
  uint16_t parsed_cell;
  uint16_t received_pec;
  uint16_t data_pec;
  uint8_t pec_error=0;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */


  	  uint8_t TxData[8];
  	  TxData[0] = 1;
  	  TxData[1] = 2;
  	  TxData[2] = 3;
  	  TxData[3] = 4;
  	  TxData[4] = 5;
  	  TxData[5] = 6;
  	  TxData[6] = 7;
  	  TxData[7] = 8;

  	  //SICCOME NON FUNZIONA --> CAN_Send(0x64, TxData, 8);
  	  /*int idsave;
  	  uint8_t RxData[8];
  	  idsave = CAN_Receive(RxData, 8);
  	  */

  	  //SEND
//  	  	HAL_StatusTypeDef status;
//
//  		CanTxMsgTypeDef TxMess;
//  		TxMess.StdId = 0x600 + 1; // 0x600 + Node ID
//  		TxMess.DLC = 0x0;
//  		TxMess.IDE = CAN_ID_STD;
//  		TxMess.RTR = 0;
//  		hcan.pTxMsg = &TxMess;
//  		status = HAL_CAN_Transmit(&hcan, 1000);
  	  //Receive
//  		CanRxMsgTypeDef RxMess;
//  		RxMess.FIFONumber = CAN_FIFO1;
//		RxMess.FMI = 14;
//		RxMess.StdId =  0x580 + 1; // 0x580 + Node ID
//		RxMess.DLC = 0;
//		RxMess.RTR = 0;
//		RxMess.IDE = CAN_ID_STD;
//		hcan.pRxMsg = &RxMess;
//		status = HAL_CAN_Receive(&hcan, CAN_FIFO1, 100);
//
//		HAL_Delay(1000);


	 //wakeup_idle1();



	 //wakeup_idle1();

//	 for(uint8_t cell_reg = 1; cell_reg<NUM_CV_REG+1; cell_reg++){                  // Executes once for each of the ltc6811 cell voltage registers
//
//		 uint8_t data_counter = 0;
//	     ltc6804_rdcv_reg(cell_reg, TOT_IC, cell_data,hspi1);

//	     for(uint8_t current_ic = 0 ; current_ic < TOT_IC; current_ic++){
//
//	    	 //Current_ic is used as the IC counter
//	 		 //Loops once for each of the 3 cell voltage codes in the register
//
//	 		 for(uint8_t current_cell = 0; current_cell < 3; current_cell++) {
//
//	 			 //Loops once for each of the 3 cell voltage codes in the register
//
//	 		   	 //Each cell code is received as two bytes and is combined to
//	 		   	 uint16_t parsed_cell = cell_data[data_counter]+(cell_reg-1)+ (cell_data[data_counter + 1] << 8);
//	 		   	 //Because cell voltage codes are two bytes the data counter
//	 		   	 cell_codes[current_ic][current_cell  + ((cell_reg - 1) * CELL_IN_REG)] = parsed_cell;
//
//
//
//	 		   	 //valori in V
//	 		   	 data_counter = data_counter + 2;
//	 		   	 uint8_t num[9];
//	 		   	 sprintf(num, "%d - ", parsed_cell);
//	 		   	 HAL_UART_Transmit(&huart2, &num, strlen(num), 100);
//
//	 		   	 HAL_Delay(100);
//	 		 }
//
//	 		 received_pec = (cell_data[data_counter] << 8) + cell_data[data_counter + 1];
//	 		 data_pec = pec15(BYT_IN_REG, &cell_data[current_ic * NUM_RX_BYT], crc15Table);
//	 		 if(received_pec != data_pec){
//	 			 pec_error = -1;
//	 		 }
//
//	 		 data_counter = data_counter + 2;
//	 		 HAL_UART_Transmit(&huart2, "\r\n", 2, 100)
//	     }

  	 /* ----- Voltages ------*/
  	 ltc6804_adcv(MD_7KHZ_3KHZ, DCP_DISABLED, CELL_CH_ALL, hspi1);
  	 //ltc6804_pollAdc(hspi1);
  	 HAL_Delay(10);
	 uint8_t data_counter = 0;
	 for(uint8_t current_ic = 0 ; current_ic < TOT_IC; current_ic++){

			 ltc6804_rdcv_reg(current_ic, TOT_IC, cell_data, hspi1);
	 	 	 uint16_t *voltages;
	 	 	 array_voltages(voltages, cell_data);
	 	 	 for(int i = 0; i < 9; i++){
	 	 		 cell_codes[current_ic][i] = voltages[i];
	 	  	 }
	 }
	 uint16_t *max_vol;
	 uint16_t *min_vol;
	 float *average_vol;
	 max_min_voltages(cell_codes, max_vol, min_vol, average_vol);
	 //Can Messages

	 /* ----- Temperatures -----*/
	 uint16_t *temp = 0;
	 //odd temp
	 ltc6804_address_temp_odd(MD_7KHZ_3KHZ, DCP_DISABLED, CELL_CH_ALL, hspi1);
	 ltc6804_adcv_temp(MD_7KHZ_3KHZ, DCP_DISABLED, CELL_CH_ALL, hspi1);
	 HAL_Delay(10);
	 for(uint8_t current_ic = 0 ; current_ic < TOT_IC; current_ic++){
		 	 ltc6804_rdcv_reg(current_ic, TOT_IC, cell_data, hspi1);
		 	 array_temp_odd(temp, cell_data);

		 	 cell_codes_temp[current_ic][0] = temp[0];
		 	 cell_codes_temp[current_ic][2] = temp[2];
		 	 cell_codes_temp[current_ic][4] = temp[4];
		 	 cell_codes_temp[current_ic][6] = temp[6];
		 	 cell_codes_temp[current_ic][8] = temp[8];

	 }
	 //ltc6804_rdcv_temp(...);
	 //convert_temp();

	 //even temp
	 ltc6804_address_temp_even(MD_7KHZ_3KHZ, DCP_DISABLED, CELL_CH_ALL, hspi1);
	 ltc6804_adcv_temp(MD_7KHZ_3KHZ, DCP_DISABLED, CELL_CH_ALL, hspi1);
	 HAL_Delay(10);
	 for(uint8_t current_ic = 0 ; current_ic < TOT_IC; current_ic++){
	 		 ltc6804_rdcv_reg(current_ic, TOT_IC, cell_data, hspi1);
	 		 array_temp_even(temp, cell_data);

	 		 cell_codes_temp[current_ic][1] = temp[1];
	 		 cell_codes_temp[current_ic][3] = temp[3];
	 		 cell_codes_temp[current_ic][5] = temp[5];
	 		 cell_codes_temp[current_ic][7] = temp[7];

	 }
	 uint16_t *max_temp = 0;
	 float *av_temp = 0;
	 max_ave_temp(cell_codes_temp, max_temp, av_temp);

	 float **converted_temp;
	 for(int i = 0; i < 12; i++){
		 for(int j = 0; j < 9; j++){
			 converted_temp[i][j] = convert_temp(cell_codes_temp[i][j]);
		 }
	 }

	 //CAN MESSAGES
	 uint16_t tot_vol = total_pack_voltage(cell_codes);
	 int id = 0;
	 CAN_Send(id,(uint8_t)max_vol, 8, hcan);
	 CAN_Send(id,(uint8_t)min_vol, 8, hcan);
	 CAN_Send(id, tot_vol, 8, hcan);
	 CAN_Send(id, (tot_vol << 8), 8, hcan);
	 CAN_Send(id,*max_temp, 8, hcan);
	 CAN_Send(id,*max_temp << 8, 8, hcan);
	 CAN_Send(id,(uint16_t)*av_temp, 8, hcan);
	 CAN_Send(id,(uint16_t)*av_temp << 8, 8, hcan);
	 for(int i = 0; i < TOT_IC; i++){
		 for(int j = 0; j < 9; j++){
			 CAN_Send(id, (uint8_t)cell_codes[i][j], 8, hcan);
			 CAN_Send(id, (uint8_t)cell_codes[i][j] << 8, 8, hcan);
			 CAN_Send(id, (uint8_t)cell_codes_temp[i][j], 8, hcan);
			 CAN_Send(id, (uint8_t)cell_codes_temp[i][j] << 8, 8, hcan);
		 }
	 }

	 // GPIO Logic
	 //Precharge off
	 HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET);
	 GPIO_PinState ShutDown_Status;
	 ShutDown_Status = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6);
	 if(ShutDown_Status == GPIO_PIN_SET){
		 uint8_t *totalPack;
		 uint8_t *tractiveVoltage;
		 HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
		 /////////////////////spi_write_read(cmd,4,totalPack,8,hspi1);
		 	// Output_high
		 HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
		 if(totalPack == tractiveVoltage){
		 // Monitorare Total voltage e tractive system voltage
		 // Quando sono uguali ---> precharge on
			 HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET);
		 }
	 }
 }

  /* USER CODE END 3 */

